# Типы данных
x = True # Булевый тип
y = 10 # Целочисленный тип
z = 3.5 # Вещественный тип
k = [10, x, 3.5, y]  # Список
l = {'Федя': 12, 'Карина': 98} # Словарь
s = 'Строчка :) 😊' # Строковый тип

# Базовые операции и методы

print('Вывод текста')
name = input('Введи имя - ввод текста: ')
welcome = name + ', привет!' # Создание новых переменных из существующих
print(welcome)

# Создайте список с 3 вещами, которые вы цените и выведите их отдельно на отдельных строчках

my_things = ['Здоровье', 'Симфонический постапокалиптический оленебойный антихристианский экстремально-языческий финноскандидавский метал', 'Еда']

# Цикл, который перебирает все элементы списка my_things

for thing in my_things:
    print(thing)

